void Fill_Grip (GLfloat V[]) // заполняет входной массив для шины
{
V[0] = -30.0;
V[1] = 40.0;
V[2] = -27.0;
V[3] = 45.0;
V[4] =  -20.0;
V[5] = 50.0;
V[6] = 20.0;
V[7] = 50.0;
V[8] = 27.0;
V[9] = 45.0;
V[10] = 30.0;
V[11] = 40.0;
}
void Fill_Line(GLfloat V_in[], GLfloat v_in[]) //заполняет входной массив для диска 
{
	V_in[0] = 25.0f;
	V_in[1] = 0.0f;
	V_in[2] = 30.0f;
	V_in[3] = 20.0f;
	V_in[4] = -30.0f;
	V_in[5] = 20.0f;
	V_in[6] = -25.0f;
	V_in[7] = 0.0f;
	v_in [0] = 176.0f;
	v_in [1] = 200.0f;
	v_in [2] = 212.0f;
	v_in [3] = 176.0f;
	v_in [4] = 196.0f;
	v_in [5] = 222.0f;
	v_in [6] = 176.0f;
	v_in [7] = 196.0f;
	v_in [8] = 222.0f;
	v_in [9] = 176.0f;
	v_in [10] = 200.0f;
	v_in [11] = 212.0f;
}
void Fill_Disk(GLfloat v[])
{
	v[0] = -20;
	v[1] = 10;
	v[2] = 5;
	v[3] = -10;
	v[4] = 8;
	v[5] = 4;
	v[6] = 0.0;
	v[7] = 7;
	v[8] = 3;
	v[9] = 10;
	v[10] = 8;
	v[11] = 5;
}
void Fill_Disk_2(GLfloat v[], GLfloat v_in[])
{
	v[0] = 30.0;
	v[1] = 40.0f; 
	v[2] = 30.1;
	v[3] = 39.0f;
	v[4] = 26.0f;
	v[5] = 36.0;
	v[6] = 26.0f;
	v[7] = 30.0f;
	v[8] = 28.0f;
	v[9] = 25.0f;
	v[10] = 16.0;
	v[11] = 16.0f; 
	v_in [0] = 0.0f;
	v_in [1] = 178.0f;
	v_in [2] = 238.0f;
	v_in [3] = 176.0f;
	v_in [4] = 196.0f;
	v_in [5] = 222.0f;
	v_in [6] = 176.0f;
	v_in [7] = 196.0f;
	v_in [8] = 222.0f;
	v_in [9] = 176.0f;
	v_in [10] = 200.0f;
	v_in [11] = 212.0f;
	v_in [12] = 176.0f;
	v_in [13] = 200.0f;
	v_in [14] = 212.0f;
	v_in [15] = 176.0f;
	v_in [16] = 200.0f;
	v_in [17] = 212.0f;
}
void FillDisk3(GLfloat v[], GLfloat v_in[])
{
	v[0] = 16.0;
	v[1] = 16.0f; 
	v[2] = 22.0f;
	v[3] = 16.0f;
	v[4] = 22.0f;
	v[5] = 10.0;
	v[6] = 25.0f;
	v[7] = 10.0f;
	v[8] = 25.0f;
	v[9] = 0.0f;
	v_in [0] = 0.0f;
	v_in [1] = 0.0f;
	v_in [2] = 0.0f;
	v_in [3] = 0.0f;
	v_in [4] = 0.0f;
	v_in [5] = 0.0f;
	v_in [6] = 0.0f;
	v_in [7] = 0.0f;
	v_in [8] = 0.0f;
	v_in [9] = 255.0f;
	v_in [10] = 0.0f;
	v_in [11] = 0.0f;
	v_in [12] = 255.0f;
	v_in [13] = 0.0f;
	v_in [14] = 0.0f;
}
	
	

